import { Injectable } from '@angular/core';
import { info } from 'console';
import { narrator } from '../../data/narrators';

@Injectable({
  providedIn: 'root'
})
export class NarratorService {
data:narrator[]=[
  {
  name:'انس بن مالک (رض)',
  info:'انس بن مالک بن نضر ابوحمزه انصاري خزرجي رضی الله تعالی عنه پوره لس کاله د رسول الله صلی الله علیه وسلم په خدمت کي تیر کړي وو، او په وړوکوالي کي د بدر په غزا کې شریک شوی. په لمانځه کولو کې رسول الله صلی الله علیه وسلم ته ډیر ورته و. یو له هغو صحابه وو څخه دی چي زیات شمیر حدیث یي روایت کړي دي. له ده څخه د روایت شویو احادیثو شمیر څه د پاسه دوه زره او دوه سوو احادیثو ته رسیږي. دپیغمبر صلی الله علیه وسلم له وفات نه وروسته د جهادونو او فتوحاتو په دور کې په بصره کي استوګن شو، او په بصره کې وروستی صحابي و چې د هجرت په سلم کال څه د پاسه سلو کلونو په عمر وفات شو.'
  }
  ,
  {
    name:'عویمر بن عامر (رض)',
    info:'عویمر د عامر د خزرج له قبیلي څخه و او په ابودردأ يې شهرت درلود. ډیر لوی فقیه صحابي وو. پیغمبر صلی الله علیه وسلم ورته د حکیم الامة لقب ورکړی وو. کله چي مسلمانانو مدیني منوري ته هجرت وکړ، نو پیغمبر صلی الله علیه وسلم دده او سلمان فارسي رضی الله تعالی عنه ترمنځ د مواخات (ورورګلوۍ) تړون وتاړه. په ټولو غزاګانو کې د رسول الله صلی الله علیه وسلم سره ملګری و. حضرت عثمان رضی الله تعالی عنه د دمشق قاضي مقرر کړی و. نوموړی د هجرت په (۳۲) کال  د حضرت عثمان رضی الله تعالی عنه دخلافت په دور کې په دمشق کې وفات شو.'
  },
  {
    name:'حضرت عایشه رضی الله تعالی عنها',
    info:'حضرت عایشه رضی الله تعالی عنها د حضرت ابوبکر صدیق رضی الله تعالی عنه لور، د پیغمبر صلی الله علیه وسلم میرمن لو د مسلمانانو مور ده. دهجرت په دویم کال پیغمبر صلی الله علیه وسلم ور سره واده وکړ، خورا فقیه او عالمه ښځه وه، په ځانګړي ډول د پیغمبر صلی الله علیه وسلم د ژوندانه په هکله يي پوره معلومات درلودل، له پیغمبر صلی الله علیه وسلم څخه يي (۲۲۱۰) دوه زره دوه سوه لس حدیثونه روایت کړي دي او د هجرت په ۵۸ کال کې وفات شوه.'
  },
  {
    name:'عطیة بن عروة (رض)',
    info:'عطیة د عروة زوی د بنو سعد به قبیلي څخه د د رسول الله صلی الله علیه یو جلیل القدر صحابي وو، له روایتو څخه وروسته يې له د رسول الله صلی الله علیه سره ملاقات کړی، او له هغه مبارک څخه يي ځیني احادیث هم روایت کړي، په شام کې يي میشته غوره کړه او اولادونه يې په بلقأ سیمه کي اوسیدل. په ځینو روایتونو کې د عطیة بن سعد او په ځینو نورو کې د عطیة بن عمرو په نامه یاد شوی. د ده لمسی عروة د محمد بن عطیة زوی د عمر بن عبدالعزیز لخوا د یمن والي ټاکل شوی وو'
  },
  {
    name:'جابر (رض)',
    info:'نوم یي جابر او د پلار نوم يي عبدالله، د مدیني منورې د خزرج له قبیلي څخه و، پلار او زوی دواړه جلیل القدر صحابه وو، پیغمبر صلی الله علیه وسلم ورته په یوه شپه کې پنځه ویشت ځله د مغفرت دعا  کړي وه، د بدر او احد څخه پرته يي په ۱۹ غزاګانو کې د رسول الله صلی الله علیه وسلم سره برخه اخیستي ده، په خپل وخت کې د مدیني منوري لوی مجتهد او مفتي و، د هجرت په ۷۸ کال يې له فاني دنیا څخه سترګي پټې کړې'
  },
  {
    name:'ابوهریرة (رض)',
    info:'عبدالرحمن بن صخرالدوسي چې پر ابوهریرة يي شهرت درلود، د هجرت په اووم کال د خیبر له غزا څخه مخکې د دیرشو کالو په عمر د اسلام په مبارک دین مشرف شو، په همدغه غزا کې يې برخه هم واخیسته، کله چې مدینې منورې ته ورسید، په نبوي جومات کې يې د علم د زده کړې په غرض په اصحاب صفه کې شامل شو، له همدې امله یې له رسول الله صلی الله علیه وسلم څخه (۵۳۷۴) حدیثونه روأیت کړي دي.دغه جلیل القدر صحابي په تقوا او پرهیز ګارۍ مشهور او د قوي ذکاوت خاوند و، چي د هجرت په اته پنځوسم (۵۸) کال کې وفات شو.'
    },
  {
    name:'جبـیر (رض)',
    info:'نوم يي جبیر او د پلار نوم يي مطعم د قریشو له قبیلي څخه و، ډیر حلیم او په علم الانساب کې يي خورا زیاته پوهه د رلوده، یو له هغو کسانو څخه و چي هغه پاڼه يي څیره کړه کوم چي د بنو هاشم او بنو مطلب د مقاطعې په غرض قریشو لیکلې وه، هغه شخص و چې قریشو د بدر د بندیانو په سر د خبرو لپاره د استازي په توګه د پیغمبر صلی الله علیه وسلم حضور ته لیږلی و، کله چې د پیغمبر صلی الله علیه وسلم خواته راغی او د (الطور) سورت تلاوت يې واوریده، نو دده په زه يې زیاته اغیزه وکړه، هماغه و چې د حدبیــــې له سولې وروسته يې اسلام ومانه . نوموړې د هجرت په (۵۸) کال وفات شو'
  }
]
  constructor() { }


}
