import { Injectable } from '@angular/core';
import { hadith } from '../../data/hadiths';
@Injectable({
  providedIn: 'root'
})
export class HadithService {

  constructor() { }
  all_hadith:hadith[]=[
    {
      id:1,
      title:'دعملونو قبليدل',
      contents:'إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ',
      translate:'دعملو قبليدل د نیت سره تعلق لري.',
      source:'بخاری و مسلم',
      isTranslated:false
    },
    {
      id:2,
      title:'دین د خیر غوښتنی نوم دی',
      contents:'اَلدِّیْنُ اَلنَّصِیْحَةُ',
      translate:'دین د خیر غوښتنی نوم دی.',
      source:'مسلم',
      isTranslated:false
    },
    {
      id:3,
      title:'خپله ژبه وساته',
      contents:'اَمْلِکْ لِسَانَکَ',
      translate:'خپله ژبه وساته',
      source:'ترمذی',
      isTranslated:false
    },
    {
      id:4,
      title:'پټه خوله نجات دی',
      contents:'مَنْ صَمَتَ نَجَا',
     translate:'څوک چی پټه خوله سو هغه خلاص سو.',
      source:'ترمذی',
      isTranslated:false
    },
    {
      id:5,
      title:'غوصه',
      contents:'اِذَا غَضِبَ اَحَدُکُمْ فَلْیَسْکُتْ',
     translate:'ستاسي څخه چي هر څوک غضبناکه سي باید چي پټه خوله سي.',
      source:'طبرانی',
      isTranslated:false
    },
    {
      id:6,
      title:'فریب کول',
      contents:'مَنْ غَشَّ فَلَیْسَ مِنَّا ',
     translate:'هر چا چي فریب وکړی هغه زموږ څخه نه دی',
      source:'مسلم',
      isTranslated:false
    },
    {
      id:7,
      title:'حیا',
      contents:'اَلْحَیَاءُ شُعْبَةٌ مِنَ الاْیْمَانِ ',
     translate:'حیا د ایمان یوه شعبه ده',
      source:'بخاری و مسلم',
      isTranslated:false
    },
    {
      id:8,
      title:'غیبت کول',
      contents:'اَلْغَیْبَةُ اَشَدُّ مِنَ الزِّناَ ',
     translate:'غیبت کول تر زنا هم بد تر دی',
      source:'مشکوة',
      isTranslated:false
    },
    {
      id:9,
      title:'د سترګو زنا',
      contents:'زِنَا الْعَیْنِ الَنَّظَرُ ',
     translate:'د سترګو زنا ناروا کتل دي',
      source:'مشکوة',
      isTranslated:false
    },
    {
      id:10,
      title:'همسایه ته تکلیف رسول',
      contents:' لاَ یَدْخُلُ الْجَنَّةُ مَنْ لاَّیَأْمَنُ جَارُهُ بَوَائِقَهُ ',
     translate:'هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.هغه سړی به جنت ته داخل نسي چي دده همسایه ګان دده د زهیريدو څخه محفوظ نه وي.',
      source:'مسلم',
      isTranslated:false
    },
    {
      id:11,
      title:'',
      contents:' لحَدَّثَنَا أَبُو النُّعْمَانِ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ زِيَادِ بْنِ عِلَاقَةَ قَالَ سَمِعْتُ جَرِيرَ بْنَ عَبْدِ اللهِ يَقُولُ يَوْمَ مَاتَ الْمُغِيرَةُ بْنُ شُعْبَةَ قَامَ فَحَمِدَ اللهَ وَأَثْنَى عَلَيْهِ وَقَالَ عَلَيْكُمْ بِاتِّقَاءِ اللهِ وَحْدَهُ لَا شَرِيكَ لَهُ وَالْوَقَارِ وَالسَّكِينَةِ حَتَّى يَأْتِيَكُمْ أَمِيرٌ فَإِنَّمَا يَأْتِيكُمُ الْآنَ ثُمَّ قَالَ اسْتَعْفُوا (اِسْتَغْفِرُوا) لِأَمِيرِكُمْ فَإِنَّهُ كَانَ يُحِبُّ الْعَفْوَ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنِّي أَتَيْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قُلْتُ أُبَايِعُكَ عَلَى الْإِسْلَامِ فَشَرَطَ عَلَيَّ وَالنُّصْحِ لِكُلِّ مُسْلِمٍ فَبَايَعْتُهُ عَلَى هَذَا وَرَبِّ هَذَا الْمَسْجِدِ إِنِّي لَنَاصِحٌ لَكُمْ ثُمَّ اسْتَغْفَرَ وَنَزَلَ',
     translate:'موږ ته ابو نعمان حدیث بیان کړ ویل یي موږ ته ابو عوانه د زیاد بن علاقه څخه حدیث بیان کړ چي هغه ویل چي په کومه ورځ مغیره بن شعبه وفات شو نو جابر بن عبد الله ولاړ شو د الله ستاینه او ثناء یې بیان کړه او ور څخه وا مي وریده چي ویل یې : تاسو یواځي د الله څخه وویریږی چي شریک نه لري، درانه او په ارام واوسئ تر څو چي امیر درته راځي او هغه هم اوس درته راځي، بیا يې وویل: د خپل امیر د پاره بخښنه وغواړئ ځکه هغه بخښنه خوښوله، بیا يې وویل: وروسته تر دې: زه نبي صلی الله علیه وسلم ته راغلم ورته ومي ویل: زه در سره پر اسلام بیعت کوم نو هغه را باندي د هر مسلمان د خواخوږی شرط هم کښېښود نو ما هم پر دې ور سره بیعت وکړ .او د دې مسجد په رب قسم: زه ستاسو خواخوږی یم، بیا یي بخښنه وغوښته او کښته شو '
,
      source:'مسلم',
      isTranslated:false
    },
   
  ]
}
